app/Observers/ReplyObserver.php

update `topics` set `reply_count` = `reply_count` + 1, `topics`.`updated_at` = '2021-08-02 18:41:38' where `id` = 100
---
    public function creating(Reply $reply)
    {
//        $reply->content = clean($reply->content, 'user_topic_body');
        // 命令行运行迁移时不做这些操作！
        if ( ! app()->runningInConsole()) {
            $reply->topic->updateReplyCount();

update `topics` set `reply_count` = 14, `topics`.`updated_at` = '2021-08-03 09:25:18' where `id` = 97
---
    public function created(Reply $reply)
    {
        $reply->topic->reply_count = $reply->topic->replies->count();
        $reply->topic->save();