app/Observers/TopicObserver.php

delete from `replies` where `topic_id` = 69
---
    public function deleted(Topic $topic)
    {
        DB::table('replies')->where('topic_id', $topic->id)->delete();