app/Http/Controllers/RepliesController.php

    public function store(ReplyRequest $request, Reply $reply)
    {
        $reply->content = $request->content;
        $reply->user_id = Auth::id();
        $reply->topic_id = $request->topic_id;
        $reply->save();

        return redirect()->to($reply->topic->link())->with('success', '评论创建成功！');
---
insert into `replies` (`content`, `user_id`, `topic_id`, `updated_at`, `created_at`) values ('<p>测试一下</p>', 11, '97', '2021-08-03 09:25:18', '2021-08-03 09:25:18')
select * from `topics` where `topics`.`id` = '100' limit 1