app/Http/Controllers/TopicsController.php

    public function index(Request $request, Topic $topic)
    {
        $topics = $topic->withOrder($request->order)
            ->with('user', 'category')  // 预加载防止 N+1 问题
            ->paginate(20);
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4)
select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 7, 8, 9, 10)

    public function create(Topic $topic)
    {
        $categories = Category::all();
---
select * from `categories`

    public function store(TopicRequest $request, Topic $topic)
    {
        $topic->fill($request->all());
        $topic->user_id = Auth::id();
        $topic->save();
---
insert into `topics` (`title`, `category_id`, `body`, `user_id`, `excerpt`, `updated_at`, `created_at`) values ('redis队列测试', '1', '<p>redis队列测试</p>', 1, 'redis队列测试', '2021-08-02 17:19:04', '2021-08-02 17:19:04')

    public function edit(Topic $topic)
    {
        $this->authorize('update', $topic);
        $this->authorize('update', $topic);
        $categories = Category::all();
---
select * from `categories`

    public function destroy(Topic $topic)
    {
        $this->authorize('destroy', $topic);
        $topic->delete();
---
delete from `topics` where `id` = 69