app/Http/Controllers/UsersController.php

    public function update(UserRequest $request, ImageUploadHandler $uploader, User $user)
    {
        $this->authorize('update', $user);
        $data = $request->all();

        if ($request->avatar) {
            $result = $uploader->save($request->avatar, 'public', $user->id,416);
            if ($result) {
                $data['avatar'] = $result['path'];
            }
        }

        $user->update($data);
---
update `users` set `avatar` = 'http://larabbs.com/uploads/images/avatars/202108/03/11_1627952770_9O3D5SjzgF.jpg', `users`.`updated_at` = '2021-08-03 09:06:10' where `id` = 11