app/Models/User.php

    public function notify($instance)
    {
        // 如果要通知的人是当前用户，就不必通知了！
        if ($this->id == Auth::id()) {
            return;
        }

        // 只有数据库类型通知才需提醒，直接发送 Email 或者其他的都 Pass
        if (method_exists($instance, 'toDatabase')) {
            $this->increment('notification_count');
---
update `users` set `notification_count` = `notification_count` + 1, `users`.`updated_at` = '2021-08-03 09:25:18' where `id` = 1

    public function markAsRead()
    {
        $this->notification_count = 0;
        $this->save();
---
update `users` set `notification_count` = 0, `users`.`updated_at` = '2021-08-03 09:33:14' where `id` = 1